# Working with DataFrames Part3

## GroupBy

Imports

In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

#### Create a dataframe

In [4]:
#Let's make a dframe
df = DataFrame({'key1':['X','X','Y','Y','Z','W'],
                'key2':['alpha','beta','alpha','beta','alpha','beta'],
                'Col1':np.random.randn(6),
                'Col2':np.random.randn(6)})

#Show
df

  key1   key2      Col1      Col2
0    X  alpha -0.706723  0.848279
1    X   beta  0.051859 -1.442593
2    Y  alpha  0.567029 -0.239267
3    Y   beta  1.141767  0.266391
4    Z  alpha  0.130104 -0.968121
5    W   beta  0.735264 -1.723260

#### Let's see how to use groupby

In [32]:
#Lets grab the col1 column and group it by the k1 key
df.groupby(['key1']).mean()

          Col1      Col2
key1
W     0.735264 -1.723260
X    -0.327432 -0.297157
Y     0.854398  0.013562
Z     0.130104 -0.968121

In [26]:
# Or multiple column names
df.groupby(['key1','key2']).mean()

                Col1      Col2
key1 key2
W    beta   0.735264 -1.723260
X    alpha -0.706723  0.848279
     beta   0.051859 -1.442593
Y    alpha  0.567029 -0.239267
     beta   1.141767  0.266391
Z    alpha  0.130104 -0.968121

In [27]:
#Now we can perform operations on this particular group
df.groupby(['key1','key2']).count()

            Col1  Col2
key1 key2
W    beta      1     1
X    alpha     1     1
     beta      1     1
Y    alpha     1     1
     beta      1     1
Z    alpha     1     1

In [20]:
# We can use group keys that are series as well

#For example:

#We'll make some arrays for use as keys
cities = np.array(['NY','LA','LA','NY','NY','LA'])
month = np.array(['JAN','FEB','JAN','FEB','JAN','FEB'])

#Now using the data from dataset1, group the means by city and month
df['Col1'].groupby([cities,month]).mean()

LA  FEB    0.393561
    JAN    0.567029
NY  FEB    1.141767
    JAN   -0.288309
Name: Col1, dtype: float64

In [21]:
# let's see the original dframe again.
df

  key1   key2      Col1      Col2
0    X  alpha -0.706723  0.848279
1    X   beta  0.051859 -1.442593
2    Y  alpha  0.567029 -0.239267
3    Y   beta  1.141767  0.266391
4    Z  alpha  0.130104 -0.968121
5    W   beta  0.735264 -1.723260

In [22]:
# WE can also pass column names as group keys
df.groupby('key1').mean()

          Col1      Col2
key1
W     0.735264 -1.723260
X    -0.327432 -0.297157
Y     0.854398  0.013562
Z     0.130104 -0.968121

In [11]:
# Another useful groupby method is getting the group sizes
dframe.groupby(['k1']).size()

k1
X     2
Y     2
Z     1
dtype: int64

In [12]:
# We can also iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print "This is the %s group" %name
    print group
    print '\n'

This is the X group
   dataset1  dataset2 k1     k2
0 -0.123544  1.924614  X  alpha
1 -1.448666  0.477115  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -1.139759 -1.378362  Y  alpha
3 -0.617664 -0.105714  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.573748  0.409242  Z  alpha

In [13]:
# We can also iterate with multiple keys
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print "Key1 = %s Key2 = %s" %(k1,k2)
    print group
    print '\n'

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2
0 -0.123544  1.924614  X  alpha


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2
1 -1.448666  0.477115  X  beta


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2
2 -1.139759 -1.378362  Y  alpha


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2
3 -0.617664 -0.105714  Y  beta


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2
4 -0.573748  0.409242  Z  alpha

In [14]:
# A possibly useful tactic is creating a dictionary of the data pieces 
group_dict = dict(list(dframe.groupby('k1')))

#Show the group with X
group_dict['X']

   dataset1  dataset2 k1     k2
0 -0.123544  1.924614  X  alpha
1 -1.448666  0.477115  X   beta

In [15]:
# We could have also chosen to do this with axis = 1

# Let's creat a dictionary for dtypes of objects!
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

#show
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.123544  1.924614
 1 -1.448666  0.477115
 2 -1.139759 -1.378362
 3 -0.617664 -0.105714
 4 -0.573748  0.409242, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [16]:
# Next we'll learn how to use groupby with columns

In [18]:
# For example if we only wanted to group the dataset2 column with both sets of keys
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  1.924614
   beta   0.477115
Y  alpha -1.378362
   beta  -0.105714
Z  alpha  0.409242

In [19]:
#Next we'll have a quick lesson on grouping with dictionaries and series!